<template>
<div id="dbg-btn" class="btn btn-primary" v-on:click="dbgBtnHandler">Send</div>
</template>


<script>
export default{
data () {
  return {
      userData: "Талон № С20190201-387085 ГБУЗ ГП № 23 ДЗМ филиал № 5 15 Февраля 2019, Пт, 11:36 Врач-офтальмолог Яровкина Лариса Юрьевна 439 каб",
      userData1: "Талон № С20190201-387085 ГБУЗ ГП № 23 ДЗМ филиал № 5 25 Февраля 2019, Пн, 08:36 Врач-терапевт Бухарин Николай Константинович 534 каб",
      userData2: "Талон № С20190304-383082 ГБУЗ ГП № 23 ДЗМ филиал № 5 12 Марта 2019, Вт, 16:36 Врач-Лор Носопыркин Фёдор Анисимович 32 каб",
      userData3: "Талон № С20190422-383045 ГБУЗ ГП № 23 ДЗМ филиал № 3 24 Апреля 2019, Ср, 14:05 Врач-невролог Боткин Кузьма Геннадиевич 921 каб",
      userData4: "Талон № С20190412-387183 ГБУЗ ГП № 23 ДЗМ филиал № 5 24 Февраля 2019, Ср, 18:24 Врач-офтальмолог Яровкина Лариса Юрьевна 439 каб",
      userData5: "Талон № С20190601-387455 ГБУЗ ГП № 23 ДЗМ филиал № 3 15 Июня 2019, Сб, 11:36 Врач-гинеколог Ройзман Лариса Борисовна 319 каб",
      userData6: "Талон № С20190608-387535 ГБУЗ ГП № 23 ДЗМ филиал № 3 15 Июня 2019, Сб, 10:36 Врач-терапевт Бухарин Николай Константинович 534 каб",
      userData7: "Талон № С20190703-388035 ГБУЗ ГП № 23 ДЗМ филиал № 5 12 Июля 2019, Пт, 12:00 Врач-офтальмолог Яровкина Лариса Юрьевна 439 каб",
      userData8: "Талон № С20190802-389012 ГБУЗ ГП № 23 ДЗМ филиал № 5 5 Августа 2019, Пн, 09:36 Врач-офтальмолог Яровкина Лариса Юрьевна 439 каб",
      userData9: "Талон № С20190806-389088 ГБУЗ ГП № 23 ДЗМ филиал № 2 6 Августа 2019, Вт, 15:45 Врач-терапевт Бухарин Николай Константинович 439 каб"
    }
},
methods: {
    dbgBtnHandler: function(){
      let data = {};
      data.userData = this.userData9;
         
      axios.post('/quiz', data)
      .then(function (response) {
        document.write(response.data);
      })
      .catch(function (error) {
        console.log(error);
      });
    }
    }
}
</script>



<style>

</style>